#!/bin/bash

triang () {

local num=$1

for t in $(seq 1 $num)
do
  let local t1=$t+1
  let local calc=$t*$t1/2
  echo $calc
done

}

n=$1

if [ -z $1 ]
then
        echo "პროგრამა სამკუთხედის რიცხვის საპოვნელად"
        read -p "შეიყვანეთ რიცხვი: " n
        echo "-----------------------------------------------"
        triang $n
        echo "-----------------------------------------------"
else
        echo "-----------------------------------------------"
        triang $n
        echo "-----------------------------------------------"
fi
