#!/bin/bash

fib () {

        x=0
        y=1
        i=2
        echo "ფიბონაჩის მიმდევრობა $1:"

        if [ $1 -le 1 ]
        then
                echo 0
        else
                echo $x
                echo $y
        fi

        while [ $i -lt $1 ]
        do
                i=`expr $i + 1`
                z=`expr $x + $y`
                echo "$z"
                x=$y
                y=$z
        done

}

n=$1

if [ -z $1 ]
then
        echo "პროგრამა ფიბონაჩის მიმდევრობების საპოვნელად"
        read -p "რამდენი რიცხვის პოვნა გსურთ: " n
        echo "-----------------------------------------------"
        fib $n
        echo "-----------------------------------------------"
else
        echo "-----------------------------------------------"
        fib $n
        echo "-----------------------------------------------"
fi
